improve gpu ux
